{"id":8361,"date":"2022-03-04T13:07:03","date_gmt":"2022-03-04T13:07:03","guid":{"rendered":"https:\/\/www.realinteract.com\/?p=8361"},"modified":"2022-03-04T13:07:03","modified_gmt":"2022-03-04T13:07:03","slug":"best-outbound-sales-call-center","status":"publish","type":"post","link":"https:\/\/www.realinteract.com\/best-outbound-sales-call-center\/","title":{"rendered":"Best Outbound Sales Call Center"},"content":{"rendered":"<h2>The Best Outbound Sales Call Center<\/h2>\n<p>In this way, there are 3 PCI boards in total Best Outbound Sales Call Center. In addition, to take into account the future expansion, the number of slots in the server motherboard is 6 PCI slots.<\/p>\n<p><strong>What are the components of a call center?<\/strong><\/p>\n<p>PSTN (Public Switched Telephone Network, Public Switched Telephone Network): The telephone network provided by the communication company.<\/p>\n<p>PBX (Private Branch Exchange, user-level switch): that is, the user-level switch at the central office installed in the enterprise by the communication company, and the entrance and exit equipment of the entire call center.<\/p>\n<p>CTI (Computer Telephony Integration, Computer Telephony Integration): operate the interconnected scheduling system between the PBX and the agent.<\/p>\n<p>ACD (Automatic Call Distribution): Also known as queuing machine, more precisely it is a description of the logical function of the entire front desk access system of the call center, which transfers incoming calls to the correct agent desk.<\/p>\n<p>IVR (Interactive Voice Response, interactive\/interactive voice response): According to the user&#8217;s input and playing voice prompts, the user&#8217;s voice business operations are completed.<\/p>\n<p>TSR (Telephone Service Representative, telephone service representative\/agent): that is, various customer service personnel terminals.<\/p>\n<ol>\n<li>Database, a device that stores call center data<\/li>\n<li>Recording server, which stores call recording files of the call center<\/li>\n<li>Business server, own business system server<\/li>\n<\/ol>\n<p>IP remote seat: used for large enterprises such as banks. Such enterprises have branches all over the country. If these branches make calls to each other through the central office, it will increase the cost of the company invisibly, and it cannot be used. Call forwarding after the user&#8217;s incoming call. The IP remote agent connects the phone to the Internet, so that the call is through the Internet, not through the communication company, and there is no communication fee. Also known as: Internet telephony.<\/p>\n<p>How is the call center system architecture divided?<\/p>\n<p><strong>The main modules of the call center system can be divided into ten modules:<\/strong><\/p>\n<p>Voice Board The Voice Board, as mentioned earlier, represents the physical layer in this system.<\/p>\n<p>CTI Computer Telephony Integration System. <a href=\"https:\/\/www.realinteract.com\/call-center\/\">Best Outbound Sales Call Center<\/a> In this system, we put the IVR (Interactive Automatic Voice Response System) and ACD (Automatic Call Distribution), which should have been independent, into the CTI service, mainly because the board-based call center itself is not competent. Large-scale call centres (more than 200 agents are very troublesome), there is no need to increase the complexity of the system independently.<\/p>\n<p>The <a href=\"https:\/\/en.wikipedia.org\/wiki\/Call_centre\">management system<\/a> mainly designs the IVR process of the system and configures the trunk number. Configure the system, mainly configure the environment in which the system runs, such as database connection, system initialization, etc Best Outbound Sales Call Center.<\/p>\n<p>Work Order Service The work order service is used to submit, modify, and view work order information.<\/p>\n<p>The agent service is used to provide a TCP interface for the agent-client to perform functions such as check-in and check-out of the agent, and report the status of the agent to the ACD module of the CTI.<\/p>\n<p>The report service is used to provide the WCF interface for the agent client to perform functions such as call record query and answering rate query Best Outbound Sales Call Center.<\/p>\n<p>Customer Relationship Service (CRM) is used to provide WCF interface to the agent client for customer data retrieval, input and other functions.<\/p>\n<ul>\n<li>A telephone terminal is a telephone headset or a hand-picked phone.<\/li>\n<li>Agent Client Client system used by agents.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The Best Outbound Sales Call Center In this way, there are 3 PCI boards in total Best Outbound Sales Call Center. In addition, to take into account the future expansion, the number of slots in the server motherboard is 6 &hellip; <\/p>\n<div class=\"blogger-more-holder\"><a href=\"https:\/\/www.realinteract.com\/best-outbound-sales-call-center\/\" class=\"more-link\">Continue reading<\/a><\/div>\n","protected":false},"author":1,"featured_media":8362,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[148],"tags":[335],"_links":{"self":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/posts\/8361"}],"collection":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/comments?post=8361"}],"version-history":[{"count":1,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/posts\/8361\/revisions"}],"predecessor-version":[{"id":8363,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/posts\/8361\/revisions\/8363"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/media\/8362"}],"wp:attachment":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/media?parent=8361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/categories?post=8361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/tags?post=8361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}