{"id":8438,"date":"2023-07-26T18:26:23","date_gmt":"2023-07-26T18:26:23","guid":{"rendered":"https:\/\/www.virtualinteract.com\/?p=8438"},"modified":"2023-07-26T18:26:23","modified_gmt":"2023-07-26T18:26:23","slug":"call-center-sales-trends-for-the-great-comeback","status":"publish","type":"post","link":"https:\/\/www.virtualinteract.com\/call-center-sales-trends-for-the-great-comeback\/","title":{"rendered":"Call Center Sales Trends for the Great Comeback"},"content":{"rendered":"<h2>Post-Pandemic Call Center Sales Trends<\/h2>\n<p>As the economy opens up, consumers and businesses are starting to spend again.  While some have suffered real financial hardship over the past year, others have built up a pool of post-pandemic cash.  In order to maximize share of sales going forward, businesses need to understand that expectations have changed.  Whether you market B2B or B2C, customers are more familiar than ever with online sales channels.  When they do want to speak to a human – and they usually do eventually – they expect agents to be empathetic and professional.  In other words, sales in 2021 are not the same as sales in those long ago days at the start of 2020.  At the very least, the pandemic has accelerated trends already in play.  With that in mind, here are five call center sales trends you need to realize for the post-pandemic world:<\/p>\n<h6><strong>1.) Sales – Meet Marketing<\/strong><\/h6>\n<p>Buyers are more demanding than ever.  They expect you to be knowledgeable about their situation and the challenges they face and offer consistent, focused messaging.  To do that effectively, sales and marketing need to be unified.<\/p>\n<p>The fact is, sales people are spending too much of their time not selling.  According to Forbes, about two thirds of the average sales person’s time is spent on non revenue-generating activities.  Many of those precious hours are taken up creating sales content, or conducting research on clients or sectors that would be better conducted elsewhere.<\/p>\n<p>And by ‘elsewhere’, we mean marketing. Sales and marketing need to work more closely together than ever, to make sure that, as a business, you’re delivering consistent, focused messages that filter into every piece of collateral and every customer conversation.  When marketing insights constantly feed into your sales strategy, you’ll be giving customers more of what they want: tailored, relevant information.<\/p>\n<h6><strong>2.) Forget Cold – Go Warm<\/strong><\/h6>\n<p>The death of cold calling is a hot topic.  But while having too many leads is every sale manager\\’s dream, in most cases, this isn’t the reality and a properly equipped strategic outbound sales function is a necessity.<\/p>\n<p>Having said that, the most progressive organizations don’t rely solely on cold calling in a post-pandemic world – they do warm calling instead.  How do you raise the temperature of your prospects as part of your outbound strategy?  It’s a combination of information and efficiency.<\/p>\n<h6><strong>2.) Training Needs to Stick<\/strong><\/h6>\n<p>Training sales staff to be more knowledgeable, confident and empathic is great, but at the moment largely ineffective. According to Xerox research, sales professionals lose 87% of training insights in just a month.  How do you make sure sales training is absorbed and implemented?  We suggest using gamification, video and peer learning. Get your teams together regularly – via Microsoft Teams or Zoom if necessary – to share best practice and success stories.<\/p>\n<p>And best of all, create a training journey. Give your agents a training goal, and a series of short, easy-to-absorb steps to achieve it.  Let them track progress towards that goal and take regular tests and revision sessions.  Repetition is the key to learning, but it should be fun, practice-based and easily applicable to day-to-day activities.  In a nutshell, make it easy for agents to turn training into action and action into habit.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Post-Pandemic Call Center Sales Trends As the economy opens up, consumers and businesses are starting to spend again.  While some have suffered real financial hardship over the past year, others have built up a pool of post-pandemic cash.  In order &hellip; <\/p>\n<div class=\"blogger-more-holder\"><a href=\"https:\/\/www.virtualinteract.com\/call-center-sales-trends-for-the-great-comeback\/\" class=\"more-link\">Continue reading<\/a><\/div>\n","protected":false},"author":1,"featured_media":7778,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[163],"tags":[],"_links":{"self":[{"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/posts\/8438"}],"collection":[{"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/comments?post=8438"}],"version-history":[{"count":1,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/posts\/8438\/revisions"}],"predecessor-version":[{"id":8439,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/posts\/8438\/revisions\/8439"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/media\/7778"}],"wp:attachment":[{"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/media?parent=8438"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/categories?post=8438"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.virtualinteract.com\/wp-json\/wp\/v2\/tags?post=8438"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}