{"id":4079,"date":"2019-03-17T15:26:34","date_gmt":"2019-03-17T15:26:34","guid":{"rendered":"https:\/\/www.realinteract.com\/?page_id=4079"},"modified":"2022-02-08T16:23:28","modified_gmt":"2022-02-08T16:23:28","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.realinteract.com\/terms-conditions\/","title":{"rendered":"TERMS &#038; CONDITIONS"},"content":{"rendered":"<p>[vc_row css=&#8221;.vc_custom_1622131482744{margin-top: 50px !important;}&#8221;][vc_column][vc_tta_tabs style=&#8221;modern&#8221; shape=&#8221;square&#8221; active_section=&#8221;1&#8243;][vc_tta_section i_icon_fontawesome=&#8221;fa fa-phone&#8221; add_icon=&#8221;true&#8221; title=&#8221;Call Center Terms and Conditions&#8221; tab_id=&#8221;1622130852542-2e604539-01c9&#8243;][vc_column_text]<\/p>\n<h2><strong>BPO’s RESPONSIBILITY:<\/strong><\/h2>\n<p>BPO Solution Providers LLC will hire a full-time resource on behalf of the Client to work as their remote employee. BPO will manage the resource and get the work done based on training material provided by the client.<\/p>\n<h2><strong>UPFRONT COST:<\/strong><\/h2>\n<p>Client will pay BPO $15.99\/hour and for a minimum of 45 hours\/week to hire and manage the resource for them. Client will also pay $45\/month for the phone line and $400 one-time setup.<\/p>\n<h2><strong>PAYMENT CYCLE:<\/strong><\/h2>\n<p>All payments are processed at the start of each month for a full month in advance<\/p>\n<h2><strong>PAID PILOT:<\/strong><\/h2>\n<p>The first three months is paid pilot period. Cancellation on or before the 90th day would stop the 3 months contract from kicking in. However, the cost for the first three months is applicable.<\/p>\n<h2><strong>CONTRACT RENEWAL:<\/strong><\/h2>\n<p>The contract automatically gets renewed at the end of 3 months for the next 3 months unless a one-month prior notice is served. However, this doesn’t apply if cancelled during the pilot period of first three months.<\/p>\n<h2><strong>NO REFUND POLICY:<\/strong><\/h2>\n<p>Client understands that BPO is contracting a full-time resource based on this agreement. For this BPO has to pay the resource hired for the client. Therefore, there is no refund once the client signs this agreement.<\/p>\n<h2><strong>FEDERAL HOLIDAYS:<\/strong><\/h2>\n<p>Federal Holidays are paid holidays. Resources take one hour lunch break during the 9 hours paid shift.<\/p>\n<h2><strong>Mutual Indemnification:<\/strong><\/h2>\n<p>Client agrees to indemnify BPO Solution Providers LLC (and vice-versa), and its officers harmless from liability for any obligations, judgments, claims, and costs, attorney&#8217;s fees and court costs, a rising from any acts or omissions committed by BPO Solution Providers LLC .<\/p>\n<h2><strong>Severability:<\/strong><\/h2>\n<p>If any provision of this Agreement is held by a court of competent jurisdiction to be invalid or unenforceable it shall be limited to the extent necessary to render it valid and enforceable or stricken from this Agreement if it cannot be so limited. The other provisions of this Agreement will remain in effect without being impaired or invalidated.<\/p>\n<h2><strong>Governing Law, Attorney’s Fees, And Modification of Agreement:<\/strong><\/h2>\n<p>This Agreement shall be governed by and construed in accordance with, the laws of the State of Georgia If any action at law or in equity, including an action for declaratory relief, is brought to enforce or interpret the provisions of this Agreement, and it must be filed in the State of Georgia. Any modification of this Agreement will be effective only if written and signed by both parties.<\/p>\n<h2><strong>Force Majeure &amp; Act of God: <\/strong><\/h2>\n<p>BPO Solution Providers LLC is not responsible for any unforeseen circumstance that might create a &#8220;default&#8221; situation to perform its duties under this Agreement, which includes &#8220;Acts of God&#8221; such as tornado&#8217;s, earthquakes, and floods; and\/or, vendor bankruptcies, company insolvency, Labor Disputes, or Government seizure of assets.<\/p>\n<h2>Start of Trial Period:<\/h2>\n<p>Pilot begins five business days from the day the training is started or the day BPO agents start taking calls whichever comes first.<\/p>\n<h2><strong>Terms of Service Provided by BPO Solution Providers LLC: <\/strong><\/h2>\n<p>In no event shall BPO Solution Providers LLC be liable for any direct, indirect, incidental, special, consequential, or exemplary damages resulting from the use or the inability to use the services provided by BPO Solution Providers LLC , or for the cost of procurement of substitute services, or resulting from any data, information or services obtained or transactions entered into through or arising from or in connection with the services provided by BPO Solution Providers LLC or resulting from unauthorized access to or alteration of transmissions or data, including, but not limited to, damages for loss of profits, damages arising from or in connection with, use of data or other intangibles, lost business opportunities, business interruption or lost business profits, even if BPO Solution Providers LLC has been advised of the possibility of such damages. In no event will BPO Solution Providers LLC’s liability to buyer of the services or any third party in connection with or arising from this agreement exceed the transfer fees actually received hereunder. There is no refund since the service is provided on hourly basis and BPO put in hours for the service. Customer (party receiving the services) also agrees not to solicit for direct or indirect employment any member(s)\/personal\/employees of BPO Solution Providers LLC or employees\/personal of its related affiliates that come in contact with the Customer, without a written approval of the management of BPO Solution Providers LLC . BPO Solution Providers LLC reserves the right to cancel the service with a prior notice of Two weeks.  Please note for American Express cards there will be a 5% additional surcharge.<\/p>\n<p>There will be a 10% increase in the cost after every 12 months keeping in mind the annual Inflation<\/p>\n<p>Pricing for onshore team is $26\/hr with $700\/agent One-time set-up cost.[\/vc_column_text][\/vc_tta_section][vc_tta_section i_icon_fontawesome=&#8221;fa fa-headphones&#8221; add_icon=&#8221;true&#8221; title=&#8221;Live Chat Terms And Conditions&#8221; tab_id=&#8221;1622130852504-f0c9e55c-d4ac&#8221;][vc_column_text]<\/p>\n<h2><strong>TRIAL AND IT&#8217;S CONDITIONS<\/strong><\/h2>\n<p>After three months of service we&#8217;ll charge you for the leads we generate during the first month only if you are happy with the results we produce and you are satisfied with the level of our service. Otherwise it&#8217;s ABSOLUTELY FREE.<\/p>\n<h2><strong>WHAT&#8217;S THE DEFINITION OF A LEAD?<\/strong><\/h2>\n<p>Even though we are driven to gather all the information you request during the training process, a lead could be as simple as following:<br \/>\n– Chat with name, phone and email address.<br \/>\n– Chat with name and phone number.<br \/>\n– Chat with name and email address.<br \/>\n– Chat with email address.<br \/>\n– Chat with phone number.<br \/>\n– Chat with email and phone number.<\/p>\n<p>In simple terms it&#8217;s a chat where you something to follow up on.<\/p>\n<h2><strong>TERMS OF SERVICE PRO VIDEO BY BPO SOLUTION PROVIDERS LLC:<\/strong><\/h2>\n<p>In no event shall BPO Solution Providers LLC be liable for any direct, indirect, incidental, special, consequential or example Ryan damages resulting from the use or inability to use the services provided by BPO Solution Providers LLC, or for the cost of procurement of substitute services, or resulting from any data, information or service a obtained or transactions entered into through or arising from or in connection with the services provided by BPO Solution Providers LLC or resulting from unauthorized access to or alteration of transmission or data, including, but not limited to, damages of loss of profits, damages arising from or in connection with, use of data or other intangibles, lost business opportunities, business interruption or lost business profit, even if BPO Solution Providers LLC has been advised of the possibility of such damages. In no even will BPO Solution Providers LLC &#8216; liability to buyer of the service or any third party in connection with or arising from this agreement exceed the transfer fees actually received by BPO Solution Providers LLC. Please note for American Express card there will be 5 % additional surcharge.[\/vc_column_text][\/vc_tta_section][\/vc_tta_tabs][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2><strong>CANCELLATION POLICY:<\/strong><\/h2>\n<p>The contract automatically gets renewed every 12 month for the next 12 months.<br \/>\nEvery 11th month client can cancel the service giving one month cancellation notice<\/p>\n<p>Once contract kicks in, client would be required to pay an amount equivalent of four times the average monthly cost of the service for early termination.<\/p>\n<p>BPO Solution Providers’ liability in an case doesn’t exceed the cost it incurs to provide the client the chat service.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row css=&#8221;.vc_custom_1622131482744{margin-top: 50px !important;}&#8221;][vc_column][vc_tta_tabs style=&#8221;modern&#8221; shape=&#8221;square&#8221; active_section=&#8221;1&#8243;][vc_tta_section i_icon_fontawesome=&#8221;fa fa-phone&#8221; add_icon=&#8221;true&#8221; title=&#8221;Call Center Terms and Conditions&#8221; tab_id=&#8221;1622130852542-2e604539-01c9&#8243;][vc_column_text] BPO’s RESPONSIBILITY: BPO Solution Providers LLC will hire a full-time resource on behalf of the Client to work as their remote employee. BPO will &hellip; <\/p>\n<div class=\"blogger-more-holder\"><a href=\"https:\/\/www.realinteract.com\/terms-conditions\/\" class=\"more-link\">Continue reading<\/a><\/div>\n","protected":false},"author":1,"featured_media":7052,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/pages\/4079"}],"collection":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/comments?post=4079"}],"version-history":[{"count":13,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/pages\/4079\/revisions"}],"predecessor-version":[{"id":8353,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/pages\/4079\/revisions\/8353"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/media\/7052"}],"wp:attachment":[{"href":"https:\/\/www.realinteract.com\/wp-json\/wp\/v2\/media?parent=4079"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}